app/controllers/users_controller.rb

INSERT INTO "users" ("name", "salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES('', 'dae8f7ad47e21dd00e94a7bc7b6c8b04989416c1', '2009-11-25 19:30:48', '904015175b4d287ad81426d9b3e191b77a73af80', NULL, '2009-11-25 19:30:48', NULL, 'quire', 'quire@example.com')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save